#include <stdio.h>




/*
把n个骰子扔在地上，所有骰子朝上一面的点数之和为s。输入n，打印出s的所有可能的值出现的概率。

你需要用一个浮点数数组返回答案，其中第 i 个元素代表这 n 个骰子所能掷出的点数集合中第 i 小的那个的概率。

示例 1:
输入: 1
输出: [0.16667,0.16667,0.16667,0.16667,0.16667,0.16667]

示例 2:
输入: 2
输出: [0.02778,0.05556,0.08333,0.11111,0.13889,0.16667,0.13889,0.11111,0.08333,0.05556,0.02778]

限制：

1 <= n <= 11
*/


/*
和s的范围 = [n,2n],长度为 n*5+1
出现的总次数 = 6^n
和s出现的概率=s元素出现的次数/总次数

n个骰子的s元素与n-1个有关，使用动态规划

*/

double* twoSum(int n, int* returnSize){

    int dp[70];
    memset(dp,0,sizeof(dp));

    for(int i=1;i<=6;i++)
    {
        dp[i] = 1;//1个骰子，s出现次数相同
    }
    for(int i=2;i<=n;i++)
    {
        for(int j=i*6;j>=i;j--)//倒序叠加，窗口[1,6]
        {
            dp[j] = 0;//注意，先把要填入位置清0才可以叠加，否则叠加错误
            for(int k=1;k<=6;k++)
            {
                if(j-k < i-1)   break;//n-1个骰子，最小值就是n-1，如两个骰子最小值就是2，这里溢出就要break
                dp[j] += dp[j-k]; //叠加，注意从j=6开始窗口缩减
            }
        }
    }

    double all = 1.0/pow(6,n);

    double *res = (double *)calloc(n*5+1,sizeof(double));
    int len = 0;
    for(int i=n;i<=6*n;i++)
    {
        res[len++] = dp[i] *all;
    }
    *returnSize = len;
    return res;
}
