/*


定义一个二维数组N*M（其中2<=N<=10;2<=M<=10），如5 × 5数组下所示： 


int maze[5][5] = {


        0, 1, 0, 0, 0,


        0, 1, 0, 1, 0,


        0, 0, 0, 0, 0,


        0, 1, 1, 1, 0,


        0, 0, 0, 1, 0,


};


它表示一个迷宫，其中的1表示墙壁，0表示可以走的路，只能横着走或竖着走，不能斜着走，要求编程序找出从左上角到右下角的最短路线。入口点为[0,0],既第一空格是可以走的路。

Input

一个N × M的二维数组，表示一个迷宫。数据保证有唯一解,不考虑有多解的情况，即迷宫只有一条通道。

Output

左上角到右下角的最短路径，格式如样例所示。

Sample Input

0 1 0 0 0

0 1 0 1 0

0 0 0 0 0

0 1 1 1 0

0 0 0 1 0

Sample Output

(0, 0)

(1, 0)

(2, 0)

(2, 1)

(2, 2)

(2, 3)

(2, 4)

(3, 4)

(4, 4)
 

 

 
输入描述:

输入两个整数，分别表示二位数组的行数，列数。再输入相应的数组，其中的1表示墙壁，0表示可以走的路。数据保证有唯一解,不考虑有多解的情况，即迷宫只有一条通道。

输出描述:

左上角到右下角的最短路径，格式如样例所示。

示例1
输入
复制

5 5
0 1 0 0 0
0 1 0 1 0
0 0 0 0 0
0 1 1 1 0
0 0 0 1 0

输出
复制

(0,0)
(1,0)
(2,0)
(2,1)
(2,2)
(2,3)
(2,4)
(3,4)
(4,4)

*/

#include<stdio.h>

typedef struct
{
    int x;
    int y;
}point;

int num[10][10];
point stack[100];
int count = 0;
int m,n;

void trace(int x,int y)
{
    point p ={x,y};
    stack[count++] = p; //当前节点入栈
    
    num[x][y] = 1;//标记已访问
    
    //如果遇到出口，则打印
    if(x == m - 1 && y == n - 1)
    {
        for(int i = 0;i < count;i++)
            printf("(%d,%d)\n",stack[i].x,stack[i].y);
        return ;
    }
    //四个方向进行搜索
    if(x + 1 < m && num[x + 1][y] == 0)
        trace(x + 1,y);
    if(x - 1 >= 0 && num[x - 1][y] == 0)
        trace(x - 1,y);
    if(y + 1 < n && num[x][y + 1] == 0)
        trace(x,y + 1);
    if(y - 1 >= 0 && num[x][y - 1] == 0)
        trace(x,y - 1);
    
    count--; //出栈
    num[x][y] = 0;//还原
}

int main(void)
{
    while(scanf("%d %d",&m,&n) != EOF)
    {
        count = 0;
        for(int i = 0;i < m;i++)
        {
            for(int j = 0;j < n;j++)
            {
                scanf("%d ",&num[i][j]);
            }
        }
        trace(0,0);
    }
}



